app/controllers/beer_controller.rb

  def index
    @beer = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    beer = Beer.new({
      name: params[:beer][:name],
      vendor_lead_time: params[:beer][:vendor_lead_time],
      bottled: params[:beer][:bottled],
      created_at: params[:beer][:created_at],
      updated_at: params[:beer][:updated_at],
      brewery_id: params[:beer][:brewery_id]
      })

    beer.save
---
INSERT INTO "beers" ("name", "vendor_lead_time", "bottled", "created_at", "updated_at", "brewery_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Cash Money"], ["vendor_lead_time", 3], ["bottled", true], ["created_at", "2021-10-13 23:28:14.154446"], ["updated_at", "2021-10-13 23:28:14.154446"], ["brewery_id", 1]]

  def show
    @beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]