app/controllers/brewery_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    @brewery = Brewery.all.order(params[:created_at]).reverse

INSERT INTO "breweries" ("name", "created_at", "updated_at", "number_of_employees", "employee_owned") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Odell"], ["created_at", "2021-10-09 00:00:00"], ["updated_at", "2021-10-13 00:00:00"], ["number_of_employees", 40], ["employee_owned", false]]
---
  def create
    brewery = Brewery.new({
      name: params[:brewery][:name],
      number_of_employees: params[:brewery][:number_of_employees],
      employee_owned: params[:brewery][:employee_owned],
      created_at: params[:brewery][:created_at],
      updated_at: params[:brewery][:updated_at]
      })

    brewery.save

SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @brewery = Brewery.find(params[:id])