app/controllers/employee_controller.rb

  def index
    @employee = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    employee = Employee.new({
      name: params[:employee][:name],
      weekly_hours: params[:employee][:weekly_hours],
      over_21: params[:employee][:over_21],
      created_at: params[:employee][:created_at],
      updated_at: params[:employee][:updated_at],
      restaurant_id: params[:employee][:restaurant_id]
      })

    employee.save
---
INSERT INTO "employees" ("name", "weekly_hours", "over_21", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Jane Doe"], ["weekly_hours", 24], ["over_21", false], ["created_at", "2021-10-13 22:07:19.049513"], ["updated_at", "2021-10-13 22:07:19.049513"], ["restaurant_id", 2]]

  def show
    @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]