app/controllers/restaurant_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurant = Restaurant.all

INSERT INTO "restaurants" ("name", "seats", "serve_liquor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Taste of Bombay"], ["seats", 35], ["serve_liquor", true], ["created_at", "2021-10-14 20:00:20.074553"], ["updated_at", "2021-10-14 20:00:20.074553"]]
---
  def create
    restaurant = Restaurant.new({
      name: params[:restaurant][:name],
      seats: params[:restaurant][:seats],
      serve_liquor: params[:restaurant][:serve_liquor],
      created_at: params[:restaurant][:created_at],
      updated_at: params[:restaurant][:updated_at]
      })

    restaurant.save