app/controllers/restaurant_employees_controller.rb

  def index
    @restaurants = Restaurant.find(params[:id])
    @employees = @restaurants.employees

    if params[:sort_by] == "name"
      @employees = @restaurants.employee_sort
    else
      @employees.all
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."restaurant_id" = $1  [["restaurant_id", 1]]