app/models/restaurant.rb

SELECT "restaurants".* FROM "restaurants" ORDER BY "restaurants"."created_at" ASC
---
  def self.order_desc